paper/get_set_benchmark/raw/redis-get-set-9-1.txt
4         Threads
64        Connections per thread
500000    Requests per client


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets      2607873.43          ---          ---         5.64928         5.79100         6.65500         8.83100    198362.14 
Gets       289763.71     56844.42    232919.29         5.64924         5.79100         6.65500         8.83100     12891.72 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals    2897637.14     56844.42    232919.29         5.64928         5.79100         6.65500         8.83100    211253.85 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.023        0.000
SET       3.583        5.000
SET       5.151       10.000
SET       5.343       15.000
SET       5.407       20.000
SET       5.503       25.000
SET       5.567       30.000
SET       5.631       35.000
SET       5.695       40.000
SET       5.759       45.000
SET       5.791       50.000
SET       5.823       52.500
SET       5.855       55.000
SET       5.887       57.500
SET       5.919       60.000
SET       5.951       62.500
SET       5.983       65.000
SET       6.015       67.500
SET       6.047       70.000
SET       6.079       72.500
SET       6.111       75.000
SET       6.111       76.250
SET       6.143       77.500
SET       6.143       78.750
SET       6.175       80.000
SET       6.175       81.250
SET       6.207       82.500
SET       6.207       83.750
SET       6.239       85.000
SET       6.239       86.250
SET       6.271       87.500
SET       6.271       88.125
SET       6.303       88.750
SET       6.303       89.375
SET       6.303       90.000
SET       6.335       90.625
SET       6.335       91.250
SET       6.335       91.875
SET       6.367       92.500
SET       6.367       93.125
SET       6.399       93.750
SET       6.399       94.062
SET       6.399       94.375
SET       6.399       94.688
SET       6.431       95.000
SET       6.431       95.312
SET       6.431       95.625
SET       6.463       95.938
SET       6.463       96.250
SET       6.463       96.562
SET       6.495       96.875
SET       6.495       97.031
SET       6.495       97.188
SET       6.527       97.344
SET       6.527       97.500
SET       6.527       97.656
SET       6.527       97.812
SET       6.559       97.969
SET       6.559       98.125
SET       6.591       98.281
SET       6.591       98.438
SET       6.591       98.516
SET       6.623       98.594
SET       6.623       98.672
SET       6.623       98.750
SET       6.623       98.828
SET       6.655       98.906
SET       6.655       98.984
SET       6.687       99.062
SET       6.687       99.141
SET       6.719       99.219
SET       6.751       99.258
SET       6.751       99.297
SET       6.783       99.336
SET       6.815       99.375
SET       6.815       99.414
SET       6.847       99.453
SET       6.911       99.492
SET       6.943       99.531
SET       7.007       99.570
SET       7.103       99.609
SET       7.167       99.629
SET       7.231       99.648
SET       7.295       99.668
SET       7.359       99.688
SET       7.455       99.707
SET       7.551       99.727
SET       7.711       99.746
SET       7.903       99.766
SET       8.095       99.785
SET       8.255       99.805
SET       8.319       99.814
SET       8.383       99.824
SET       8.447       99.834
SET       8.511       99.844
SET       8.575       99.854
SET       8.639       99.863
SET       8.703       99.873
SET       8.703       99.883
SET       8.767       99.893
SET       8.831       99.902
SET       8.895       99.907
SET       8.895       99.912
SET       8.959       99.917
SET       8.959       99.922
SET       9.023       99.927
SET       9.087       99.932
SET       9.087       99.937
SET       9.151       99.941
SET       9.215       99.946
SET       9.279       99.951
SET       9.279       99.954
SET       9.343       99.956
SET       9.343       99.958
SET       9.407       99.961
SET       9.471       99.963
SET       9.471       99.966
SET       9.535       99.968
SET       9.599       99.971
SET       9.663       99.973
SET       9.791       99.976
SET       9.791       99.977
SET       9.855       99.978
SET       9.855       99.979
SET       9.919       99.980
SET       9.919       99.982
SET       9.983       99.983
SET      10.047       99.984
SET      10.047       99.985
SET      10.111       99.987
SET      10.175       99.988
SET      10.175       99.988
SET      10.239       99.989
SET      10.239       99.990
SET      10.303       99.990
SET      10.367       99.991
SET      10.431       99.991
SET      10.495       99.992
SET      10.623       99.993
SET      10.687       99.993
SET      10.751       99.994
SET      10.815       99.994
SET      10.815       99.995
SET      10.879       99.995
SET      10.943       99.995
SET      11.007       99.995
SET      11.071       99.996
SET      11.071       99.996
SET      11.135       99.996
SET      11.199       99.997
SET      11.263       99.997
SET      11.263       99.997
SET      11.327       99.997
SET      11.327       99.997
SET      11.327       99.998
SET      11.391       99.998
SET      11.391       99.998
SET      11.391       99.998
SET      11.455       99.998
SET      11.455       99.998
SET      11.519       99.998
SET      11.519       99.999
SET      11.519       99.999
SET      11.519       99.999
[...]
SET      11.583       99.999
SET      11.583       99.999
SET      11.583       99.999
[...]
SET      11.647       99.999
SET      11.647       99.999
SET      11.647       99.999
SET      11.711       99.999
SET      11.711       99.999
SET      11.711       99.999
SET      11.775       99.999
SET      11.775       99.999
SET      11.839      100.000
SET      11.839      100.000
SET      11.839      100.000
[...]
SET      11.903      100.000
SET      11.903      100.000
SET      11.903      100.000
[...]
SET      11.967      100.000
SET      11.967      100.000
SET      11.967      100.000
[...]
SET      12.031      100.000
SET      12.031      100.000
---
GET       0.023        0.000
GET       3.583        5.000
GET       5.151       10.000
GET       5.343       15.000
GET       5.407       20.000
GET       5.503       25.000
GET       5.567       30.000
GET       5.631       35.000
GET       5.695       40.000
GET       5.759       45.000
GET       5.791       50.000
GET       5.823       52.500
GET       5.855       55.000
GET       5.887       57.500
GET       5.919       60.000
GET       5.951       62.500
GET       5.983       65.000
GET       6.015       67.500
GET       6.047       70.000
GET       6.079       72.500
GET       6.111       75.000
GET       6.111       76.250
GET       6.143       77.500
GET       6.143       78.750
GET       6.175       80.000
GET       6.175       81.250
GET       6.207       82.500
GET       6.207       83.750
GET       6.239       85.000
GET       6.239       86.250
GET       6.271       87.500
GET       6.271       88.125
GET       6.303       88.750
GET       6.303       89.375
GET       6.303       90.000
GET       6.335       90.625
GET       6.335       91.250
GET       6.335       91.875
GET       6.367       92.500
GET       6.367       93.125
GET       6.399       93.750
GET       6.399       94.062
GET       6.399       94.375
GET       6.399       94.688
GET       6.431       95.000
GET       6.431       95.312
GET       6.431       95.625
GET       6.463       95.938
GET       6.463       96.250
GET       6.463       96.562
GET       6.495       96.875
GET       6.495       97.031
GET       6.495       97.188
GET       6.527       97.344
GET       6.527       97.500
GET       6.527       97.656
GET       6.527       97.812
GET       6.559       97.969
GET       6.559       98.125
GET       6.591       98.281
GET       6.591       98.438
GET       6.591       98.516
GET       6.623       98.594
GET       6.623       98.672
GET       6.623       98.750
GET       6.623       98.828
GET       6.655       98.906
GET       6.655       98.984
GET       6.687       99.062
GET       6.687       99.141
GET       6.719       99.219
GET       6.751       99.258
GET       6.751       99.297
GET       6.783       99.336
GET       6.815       99.375
GET       6.815       99.414
GET       6.847       99.453
GET       6.911       99.492
GET       6.943       99.531
GET       7.007       99.570
GET       7.103       99.609
GET       7.167       99.629
GET       7.199       99.648
GET       7.295       99.668
GET       7.359       99.688
GET       7.455       99.707
GET       7.551       99.727
GET       7.711       99.746
GET       7.903       99.766
GET       8.095       99.785
GET       8.255       99.805
GET       8.319       99.814
GET       8.383       99.824
GET       8.447       99.834
GET       8.511       99.844
GET       8.575       99.854
GET       8.639       99.863
GET       8.639       99.873
GET       8.703       99.883
GET       8.767       99.893
GET       8.831       99.902
GET       8.895       99.907
GET       8.895       99.912
GET       8.959       99.917
GET       8.959       99.922
GET       9.023       99.927
GET       9.087       99.932
GET       9.087       99.937
GET       9.151       99.941
GET       9.215       99.946
GET       9.215       99.951
GET       9.279       99.954
GET       9.343       99.956
GET       9.343       99.958
GET       9.407       99.961
GET       9.407       99.963
GET       9.471       99.966
GET       9.535       99.968
GET       9.599       99.971
GET       9.663       99.973
GET       9.727       99.976
GET       9.791       99.977
GET       9.791       99.978
GET       9.855       99.979
GET       9.855       99.980
GET       9.919       99.982
GET       9.919       99.983
GET       9.983       99.984
GET      10.047       99.985
GET      10.111       99.987
GET      10.111       99.988
GET      10.175       99.988
GET      10.175       99.989
GET      10.239       99.990
GET      10.239       99.990
GET      10.303       99.991
GET      10.367       99.991
GET      10.431       99.992
GET      10.559       99.993
GET      10.623       99.993
GET      10.687       99.994
GET      10.751       99.994
GET      10.815       99.995
GET      10.815       99.995
GET      10.879       99.995
GET      10.943       99.995
GET      10.943       99.996
GET      11.071       99.996
GET      11.071       99.996
GET      11.199       99.997
GET      11.199       99.997
GET      11.263       99.997
GET      11.263       99.997
GET      11.263       99.997
GET      11.327       99.998
GET      11.327       99.998
GET      11.391       99.998
GET      11.391       99.998
GET      11.391       99.998
GET      11.455       99.998
GET      11.455       99.998
GET      11.519       99.999
GET      11.519       99.999
GET      11.519       99.999
[...]
GET      11.583       99.999
GET      11.583       99.999
GET      11.583       99.999
GET      11.647       99.999
GET      11.647       99.999
GET      11.647       99.999
[...]
GET      11.711       99.999
GET      11.711       99.999
GET      11.711       99.999
GET      11.775       99.999
GET      11.775      100.000
GET      11.839      100.000
GET      11.839      100.000
GET      11.839      100.000
[...]
GET      11.903      100.000
GET      11.903      100.000
GET      11.903      100.000
[...]
GET      11.967      100.000
GET      11.967      100.000
GET      11.967      100.000
[...]
GET      12.031      100.000
GET      12.031      100.000
---
WAIT      0.000      100.000